; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	thermograph2 - mode
	image1 - mode
	thermograph0 - mode
	thermograph3 - mode
	GroundStation3 - direction
	GroundStation8 - direction
	Star0 - direction
	GroundStation5 - direction
	Star2 - direction
	GroundStation7 - direction
	Star9 - direction
	Star6 - direction
	Star1 - direction
	GroundStation4 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 Star9)
	(supports instrument2 image1)
	(supports instrument2 thermograph3)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 Star1)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph3)
	(supports instrument3 image1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument4 thermograph3)
	(supports instrument4 thermograph0)
	(supports instrument4 image1)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation5)
	(supports instrument5 thermograph2)
	(supports instrument5 thermograph3)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation4)
	(calibration_target instrument5 Star2)
	(calibration_target instrument5 GroundStation7)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph3)
	(supports instrument6 image1)
	(calibration_target instrument6 Star6)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation7)
	(supports instrument7 image1)
	(supports instrument7 thermograph0)
	(calibration_target instrument7 Star9)
	(calibration_target instrument7 Star6)
	(calibration_target instrument7 GroundStation7)
	(supports instrument8 image1)
	(calibration_target instrument8 Star6)
	(supports instrument9 thermograph0)
	(supports instrument9 thermograph3)
	(calibration_target instrument9 GroundStation4)
	(calibration_target instrument9 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation3)
)
(:goal (and
	(have_image Star10 thermograph3)
	(have_image Star11 thermograph3)
	(have_image Phenomenon12 thermograph2)
	(have_image Star13 thermograph3)
	(have_image Phenomenon14 thermograph2)
	(have_image Phenomenon15 thermograph3)
	(have_image Star16 thermograph2)
))

)

; plan
1. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 0 of 7
2. (calibrate satellite2 instrument5 groundstation7)
   added: (calibrated instrument5)
   goals met: 0 of 7
3. (turn_to satellite2 phenomenon15 groundstation7)
   deleted: (pointing satellite2 groundstation7)
   added: (pointing satellite2 phenomenon15)
   goals met: 0 of 7
4. (take_image satellite2 phenomenon15 instrument5 thermograph3)
   added: (have_image phenomenon15 thermograph3)
   goals met: 1 of 7
5. (turn_to satellite2 phenomenon14 phenomenon15)
   deleted: (pointing satellite2 phenomenon15)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 7
6. (take_image satellite2 phenomenon14 instrument5 thermograph2)
   added: (have_image phenomenon14 thermograph2)
   goals met: 2 of 7
7. (turn_to satellite2 phenomenon12 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon12)
   goals met: 2 of 7
8. (take_image satellite2 phenomenon12 instrument5 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 3 of 7
9. (turn_to satellite2 star10 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star10)
   goals met: 3 of 7
10. (take_image satellite2 star10 instrument5 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 4 of 7
11. (turn_to satellite2 star11 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star11)
   goals met: 4 of 7
12. (take_image satellite2 star11 instrument5 thermograph3)
   added: (have_image star11 thermograph3)
   goals met: 5 of 7
13. (turn_to satellite2 star13 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star13)
   goals met: 5 of 7
14. (take_image satellite2 star13 instrument5 thermograph3)
   added: (have_image star13 thermograph3)
   goals met: 6 of 7
15. (turn_to satellite2 star16 star13)
   deleted: (pointing satellite2 star13)
   added: (pointing satellite2 star16)
   goals met: 6 of 7
16. (take_image satellite2 star16 instrument5 thermograph2)
   added: (have_image star16 thermograph2)
   goals met: 7 of 7
